// This query filters through Windows logs for successful logons made from a device,
SecurityEvent
| where TimeGenerated between (datetime(2025-09-06 13:00) .. datetime(2025-09-06 15:00))
| where EventID == "4624"
| where DeviceName == "xx.xxx.xxx.xx"
| sort by TimeGenerated desc
